; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_11_5)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 - boat
		p0 p1 p2 p3 p4 - person
	)

  (:init
		(= (x b0) -1)
(= (y b0) 0)
(= (x b1) 6)
(= (y b1) 0)
(= (x b2) 3)
(= (y b2) 0)
(= (x b3) 2)
(= (y b3) 0)
(= (x b4) 5)
(= (y b4) 0)
(= (x b5) 1)
(= (y b5) 0)
(= (x b6) -9)
(= (y b6) 0)
(= (x b7) -5)
(= (y b7) 0)
(= (x b8) -1)
(= (y b8) 0)
(= (x b9) 5)
(= (y b9) 0)
(= (x b10) 4)
(= (y b10) 0)

		(= (d p0) 95)
(= (d p1) 12)
(= (d p2) 95)
(= (d p3) 71)
(= (d p4) 91)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
		)
	)
)

; plan
1. (go_north_east b0)
   changed: (x b0) from -1 to 0.5, (y b0) from 0 to 1.5
   goals met: 0 of 5
2. (go_north_west b0)
   changed: (x b0) from 0.5 to -1, (y b0) from 1.5 to 3
   goals met: 0 of 5
3. (go_north_west b0)
   changed: (x b0) from -1 to -2.5, (y b0) from 3 to 4.5
   goals met: 0 of 5
4. (go_north_west b0)
   changed: (x b0) from -2.5 to -4, (y b0) from 4.5 to 6
   goals met: 0 of 5
5. (go_north_west b0)
   changed: (x b0) from -4 to -5.5, (y b0) from 6 to 7.5
   goals met: 0 of 5
6. (go_north_west b0)
   changed: (x b0) from -5.5 to -7, (y b0) from 7.5 to 9
   goals met: 0 of 5
7. (go_north_west b0)
   changed: (x b0) from -7 to -8.5, (y b0) from 9 to 10.5
   goals met: 0 of 5
8. (go_north_west b0)
   changed: (x b0) from -8.5 to -10, (y b0) from 10.5 to 12
   goals met: 0 of 5
9. (go_north_west b0)
   changed: (x b0) from -10 to -11.5, (y b0) from 12 to 13.5
   goals met: 0 of 5
10. (go_north_west b0)
   changed: (x b0) from -11.5 to -13, (y b0) from 13.5 to 15
   goals met: 0 of 5
11. (go_north_west b0)
   changed: (x b0) from -13 to -14.5, (y b0) from 15 to 16.5
   goals met: 0 of 5
12. (go_north_west b0)
   changed: (x b0) from -14.5 to -16, (y b0) from 16.5 to 18
   goals met: 0 of 5
13. (go_north_west b0)
   changed: (x b0) from -16 to -17.5, (y b0) from 18 to 19.5
   goals met: 0 of 5
14. (go_north_east b0)
   changed: (x b0) from -17.5 to -16, (y b0) from 19.5 to 21
   goals met: 0 of 5
15. (go_north_east b0)
   changed: (x b0) from -16 to -14.5, (y b0) from 21 to 22.5
   goals met: 0 of 5
16. (go_north_east b0)
   changed: (x b0) from -14.5 to -13, (y b0) from 22.5 to 24
   goals met: 0 of 5
17. (go_north_east b0)
   changed: (x b0) from -13 to -11.5, (y b0) from 24 to 25.5
   goals met: 0 of 5
18. (save_person b0 p1)
   added: (saved p1)
   goals met: 1 of 5
19. (go_north_west b0)
   changed: (x b0) from -11.5 to -13, (y b0) from 25.5 to 27
   goals met: 1 of 5
20. (go_north_west b0)
   changed: (x b0) from -13 to -14.5, (y b0) from 27 to 28.5
   goals met: 1 of 5
21. (go_north_west b0)
   changed: (x b0) from -14.5 to -16, (y b0) from 28.5 to 30
   goals met: 1 of 5
22. (go_north_west b0)
   changed: (x b0) from -16 to -17.5, (y b0) from 30 to 31.5
   goals met: 1 of 5
23. (go_north_west b0)
   changed: (x b0) from -17.5 to -19, (y b0) from 31.5 to 33
   goals met: 1 of 5
24. (go_north_west b0)
   changed: (x b0) from -19 to -20.5, (y b0) from 33 to 34.5
   goals met: 1 of 5
25. (go_north_west b0)
   changed: (x b0) from -20.5 to -22, (y b0) from 34.5 to 36
   goals met: 1 of 5
26. (go_north_west b0)
   changed: (x b0) from -22 to -23.5, (y b0) from 36 to 37.5
   goals met: 1 of 5
27. (go_north_west b0)
   changed: (x b0) from -23.5 to -25, (y b0) from 37.5 to 39
   goals met: 1 of 5
28. (go_north_west b0)
   changed: (x b0) from -25 to -26.5, (y b0) from 39 to 40.5
   goals met: 1 of 5
29. (go_north_west b0)
   changed: (x b0) from -26.5 to -28, (y b0) from 40.5 to 42
   goals met: 1 of 5
30. (go_north_west b0)
   changed: (x b0) from -28 to -29.5, (y b0) from 42 to 43.5
   goals met: 1 of 5
31. (go_north_west b0)
   changed: (x b0) from -29.5 to -31, (y b0) from 43.5 to 45
   goals met: 1 of 5
32. (go_north_west b0)
   changed: (x b0) from -31 to -32.5, (y b0) from 45 to 46.5
   goals met: 1 of 5
33. (go_north_west b0)
   changed: (x b0) from -32.5 to -34, (y b0) from 46.5 to 48
   goals met: 1 of 5
34. (go_north_west b0)
   changed: (x b0) from -34 to -35.5, (y b0) from 48 to 49.5
   goals met: 1 of 5
35. (go_north_west b0)
   changed: (x b0) from -35.5 to -37, (y b0) from 49.5 to 51
   goals met: 1 of 5
36. (go_north_west b0)
   changed: (x b0) from -37 to -38.5, (y b0) from 51 to 52.5
   goals met: 1 of 5
37. (go_north_west b0)
   changed: (x b0) from -38.5 to -40, (y b0) from 52.5 to 54
   goals met: 1 of 5
38. (go_north_east b0)
   changed: (x b0) from -40 to -38.5, (y b0) from 54 to 55.5
   goals met: 1 of 5
39. (go_north_east b0)
   changed: (x b0) from -38.5 to -37, (y b0) from 55.5 to 57
   goals met: 1 of 5
40. (go_north_east b0)
   changed: (x b0) from -37 to -35.5, (y b0) from 57 to 58.5
   goals met: 1 of 5
41. (go_north_east b0)
   changed: (x b0) from -35.5 to -34, (y b0) from 58.5 to 60
   goals met: 1 of 5
42. (go_north_east b0)
   changed: (x b0) from -34 to -32.5, (y b0) from 60 to 61.5
   goals met: 1 of 5
43. (go_north_east b0)
   changed: (x b0) from -32.5 to -31, (y b0) from 61.5 to 63
   goals met: 1 of 5
44. (go_north_east b0)
   changed: (x b0) from -31 to -29.5, (y b0) from 63 to 64.5
   goals met: 1 of 5
45. (go_north_east b0)
   changed: (x b0) from -29.5 to -28, (y b0) from 64.5 to 66
   goals met: 1 of 5
46. (go_north_east b0)
   changed: (x b0) from -28 to -26.5, (y b0) from 66 to 67.5
   goals met: 1 of 5
47. (go_north_east b0)
   changed: (x b0) from -26.5 to -25, (y b0) from 67.5 to 69
   goals met: 1 of 5
48. (go_north_east b0)
   changed: (x b0) from -25 to -23.5, (y b0) from 69 to 70.5
   goals met: 1 of 5
49. (go_north_east b0)
   changed: (x b0) from -23.5 to -22, (y b0) from 70.5 to 72
   goals met: 1 of 5
50. (go_north_east b0)
   changed: (x b0) from -22 to -20.5, (y b0) from 72 to 73.5
   goals met: 1 of 5
51. (go_north_east b0)
   changed: (x b0) from -20.5 to -19, (y b0) from 73.5 to 75
   goals met: 1 of 5
52. (go_north_east b0)
   changed: (x b0) from -19 to -17.5, (y b0) from 75 to 76.5
   goals met: 1 of 5
53. (go_north_east b0)
   changed: (x b0) from -17.5 to -16, (y b0) from 76.5 to 78
   goals met: 1 of 5
54. (go_north_east b0)
   changed: (x b0) from -16 to -14.5, (y b0) from 78 to 79.5
   goals met: 1 of 5
55. (go_north_east b0)
   changed: (x b0) from -14.5 to -13, (y b0) from 79.5 to 81
   goals met: 1 of 5
56. (go_north_east b0)
   changed: (x b0) from -13 to -11.5, (y b0) from 81 to 82.5
   goals met: 1 of 5
57. (save_person b0 p3)
   added: (saved p3)
   goals met: 2 of 5
58. (go_north_west b0)
   changed: (x b0) from -11.5 to -13, (y b0) from 82.5 to 84
   goals met: 2 of 5
59. (go_north_east b0)
   changed: (x b0) from -13 to -11.5, (y b0) from 84 to 85.5
   goals met: 2 of 5
60. (go_north_east b0)
   changed: (x b0) from -11.5 to -10, (y b0) from 85.5 to 87
   goals met: 2 of 5
61. (go_north_east b0)
   changed: (x b0) from -10 to -8.5, (y b0) from 87 to 88.5
   goals met: 2 of 5
62. (go_north_east b0)
   changed: (x b0) from -8.5 to -7, (y b0) from 88.5 to 90
   goals met: 2 of 5
63. (go_north_east b0)
   changed: (x b0) from -7 to -5.5, (y b0) from 90 to 91.5
   goals met: 2 of 5
64. (go_north_east b0)
   changed: (x b0) from -5.5 to -4, (y b0) from 91.5 to 93
   goals met: 2 of 5
65. (go_north_east b0)
   changed: (x b0) from -4 to -2.5, (y b0) from 93 to 94.5
   goals met: 2 of 5
66. (save_person b0 p4)
   added: (saved p4)
   goals met: 3 of 5
67. (go_north_east b0)
   changed: (x b0) from -2.5 to -1, (y b0) from 94.5 to 96
   goals met: 3 of 5
68. (save_person b0 p0)
   added: (saved p0)
   goals met: 4 of 5
69. (save_person b0 p2)
   added: (saved p2)
   goals met: 5 of 5
